[
  {
    "id": "intel_003",
    "date": "2025-07-20",
    "brand": "NIO",
    "model": "ET9",
    "title": "NIO ET9 final production specs revealed in MIIT filing.",
    "is_pro": true,
    "summary": "Full specifications for NIO's upcoming flagship, the ET9, have been published by China's MIIT, revealing key details about its powertrain, dimensions, and battery technology ahead of its official launch...",
    "full_content": "The full filing from the Ministry of Industry and Information Technology (MIIT) confirms that the NIO ET9 will feature a dual-motor setup with a combined power output of 520 kW. The front motor is a 180 kW induction motor, while the rear is a 340 kW permanent magnet motor. The vehicle measures 5324mm in length, 2016mm in width, and 1620mm in height, with a wheelbase of 3250mm, confirming its large executive sedan status. The filing also lists a 150 kWh semi-solid-state battery pack as an option, which is expected to deliver over 850km of CLTC range. This level of detail confirms NIO's positioning of the ET9 as a direct competitor to the likes of the Porsche Panamera and Mercedes-Benz EQS."
  },
  {
    "id": "intel_002",
    "date": "2025-07-18",
    "brand": "Xiaomi",
    "model": "SU7",
    "title": "Xiaomi SU7 production ramps up to meet overwhelming demand.",
    "is_pro": false,
    "summary": "Sources close to Xiaomi's supply chain indicate that the company is aggressively ramping up production of its popular SU7 sedan, aiming to shorten delivery times which have stretched to several months for new orders...",
    "full_content": "Sources close to Xiaomi's supply chain indicate that the company is aggressively ramping up production of its popular SU7 sedan, aiming to shorten delivery times which have stretched to several months for new orders. Key assembler BAIC is reportedly adding a second shift at its Beijing plant, which could potentially double the monthly output from around 10,000 units to nearly 20,000 units by the end of the third quarter. This move is a direct response to the unexpectedly high volume of pre-orders, which surpassed 100,000 units within the first week of launch. The ability to scale production rapidly will be a critical test for Xiaomi's automotive ambitions."
  },
  {
    "id": "intel_001",
    "date": "2025-07-15",
    "brand": "BYD",
    "model": null,
    "title": "BYD's next-generation Blade Battery technology enters production.",
    "is_pro": true,
    "summary": "BYD has officially commenced production of its second-generation Blade Battery, featuring significant improvements in energy density and charging speeds. The new LFP cells reportedly achieve an energy density of over 190 Wh/kg...",
    "full_content": "BYD has officially commenced production of its second-generation Blade Battery at its FinDreams facility in Chongqing. The new LFP cells reportedly achieve an energy density of over 190 Wh/kg at the cell level, a significant improvement from the 150 Wh/kg of the first generation. This breakthrough allows for lighter battery packs or longer range for the same pack weight. Furthermore, the new battery architecture supports charging rates of up to 6C, theoretically allowing for a 10-80% charge in under 10 minutes on compatible ultra-fast chargers. The first vehicle expected to feature this new battery is the upcoming Sea Lion 07 SUV, which will give BYD a considerable competitive advantage in the mainstream EV market."
  }
]